[
    { "objection": "expensive", "solution": "What is your budget? You can try other models or check for recommendations." },
    { "objection": "not worth", "solution": "We offer a value-for-money guarantee. Would you like to know how this product compares to others?" },
    { "objection": "not working", "solution": "Let’s troubleshoot the issue or arrange a replacement for you." },
    { "objection": "bad quality", "solution": "We ensure the highest standards. Could you share specific feedback for a resolution?" },
    { "objection": "poor service", "solution": "We apologize for the experience. Let us improve it for you immediately." },
    { "objection": "late delivery", "solution": "Sorry for the delay! Let’s track your package or provide a refund." },
    { "objection": "complicated", "solution": "We provide detailed guides and support. Can we walk you through the process?" },
    { "objection": "lack of features", "solution": "Let’s identify what features you need and recommend the right product." },
    { "objection": "too big", "solution": "We have compact models. Can I show you some alternatives?" },
    { "objection": "too small", "solution": "We have larger options available. Would you like to see them?" },
    { "objection": "unclear instructions", "solution": "Let me provide you with clearer guidance or a video tutorial." },
    { "objection": "no warranty", "solution": "We offer an extended warranty program. Would you like to know more?" },
    { "objection": "no support", "solution": "We have 24/7 support. Can I connect you with our team?" },
    { "objection": "too fragile", "solution": "We recommend this durable option. Let me share the details." },
    { "objection": "not reliable", "solution": "We guarantee reliability with a warranty. Can I assist further?" },
    { "objection": "too slow", "solution": "This model is faster. Would you like to check it out?" },
    { "objection": "not stylish", "solution": "We offer a variety of stylish designs. Can I show you some options?" },
    { "objection": "too noisy", "solution": "We have quieter models. Can I suggest one for you?" },
    { "objection": "high maintenance", "solution": "We offer low-maintenance alternatives. Let me share some choices." },
    { "objection": "not compatible", "solution": "We can find a compatible solution. Can I assist you in finding it?" },
    { "objection": "outdated", "solution": "We offer the latest models. Can I guide you to one?" },
    { "objection": "difficult to use", "solution": "Let me simplify it for you with an easy-to-follow guide." },
    { "objection": "poor reviews", "solution": "Let me address the specific concerns in those reviews for you." },
    { "objection": "hidden costs", "solution": "We’re transparent about pricing. Let me clarify any doubts." },
    { "objection": "limited options", "solution": "We’ll expand our offerings soon. Meanwhile, here are alternatives." },
    { "objection": "not available", "solution": "This product will be restocked soon. Can I notify you?" },
    { "objection": "too heavy", "solution": "We have lighter models. Can I share the details with you?" },
    { "objection": "too light", "solution": "We offer sturdier options. Would you like to know more?" },
    { "objection": "no refund policy", "solution": "We provide replacements or credits. Can I assist with this?" },
    { "objection": "limited colors", "solution": "We’ll have more colors soon. Would you consider an alternative?" },
    { "objection": "no return policy", "solution": "We ensure satisfaction. Let’s resolve your issue right away." },
    { "objection": "complicated setup", "solution": "We provide professional setup assistance. Can we help?" },
    { "objection": "missing parts", "solution": "Let’s send you the missing parts immediately." },
    { "objection": "not user-friendly", "solution": "Here’s a guide to make it simpler. Can I assist?" },
    { "objection": "low battery life", "solution": "We offer models with extended battery life. Would you like to see them?" },
    { "objection": "too bright", "solution": "We have dimmable options. Can I show you some recommendations?" },
    { "objection": "too dark", "solution": "Let’s find a brighter alternative for you." },
    { "objection": "not customizable", "solution": "We have customizable options. Let me share the details." },
    { "objection": "too generic", "solution": "Here’s a personalized option. Would you like more information?" },
    { "objection": "low resolution", "solution": "We have high-resolution models. Would you like to explore them?" },
    { "objection": "not portable", "solution": "We offer portable versions. Can I show you some options?" },
    { "objection": "not waterproof", "solution": "We have waterproof options. Let me share more details." },
    { "objection": "too expensive to maintain", "solution": "We provide cost-effective maintenance plans. Would you like more info?" },
    { "objection": "hard to clean", "solution": "We offer models with easy-clean technology. Can I assist?" },
    { "objection": "no accessories included", "solution": "Accessories are available separately. Can I help you choose?" },
    { "objection": "not eco-friendly", "solution": "We have eco-friendly alternatives. Would you like to check them out?" }
  ]
  